driver-tests/wlmse/Escalation_Xpath/VacationApprovalCompositeApp/test/submitVacation/Input.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vac="http://xml.netbeans.org/schema/VacationApproval">
  <soapenv:Body>
    <vac:vacationRequest>
      <vac:employeeId>111</vac:employeeId>
      <vac:employeeName>林惠</vac:employeeName>
      <vac:startDate>2008-09-28</vac:startDate>
      <vac:totalDays>3</vac:totalDays>
      <vac:users>john</vac:users>
      <vac:users>mary</vac:users>
    </vac:vacationRequest>
  </soapenv:Body>
</soapenv:Envelope>